### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

In [2]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

* Display the total number of players

In [3]:
total_players = len(purchase_data)
print(total_players)

780

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [108]:
number_unique_items = len(unique_items)
average_price = purchase_data["Price"].mean()
total_purchases = purchase_data["Purchase ID"].count()
total_revenue = purchase_data["Price"].sum()

summary_list = [{"Number of Unique Items": number_unique_items,
                "Average Price": average_price,
               "Total Number of Purchases": total_purchases,
               "Total Revenue": total_revenue}]
summary_df = pd.DataFrame(summary_list)
#summary_df
summary_df = summary_df.round(2)
summary_df["Average Price"]=summary_df["Average Price"].map("${0:,.0f}".format)
summary_df["Total Revenue"]=summary_df["Total Revenue"].map("${0:,.0f}".format)
summary_df

,Number of Unique Items,Average Price,Total Number of Purchases,Total Revenue
0,179,$3,780,"$2,380"

In [5]:
purchase_data.head()
#unique_players=purchase_data["SN"].unique()
#print(len(unique_players))

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [6]:
gender_total = purchase_data["Gender"].count()
gender_total
male_total = purchase_data["Gender"].value_counts()['Male']
male_percent = male_total/gender_total*100
female_total = purchase_data["Gender"].value_counts()['Female']
female_percent = female_total/gender_total*100
other_total = purchase_data["Gender"].value_counts()['Other / Non-Disclosed']
other_percent = other_total/gender_total*100

gender_data = {"Total": [male_total, female_total, other_total], "Percent": [male_percent, female_percent, other_percent]} 
gender_df = pd.DataFrame(gender_data, index=["Male", "Female", "Other / Non-Disclosed"]) 
gender_df["Percent"]=gender_df["Percent"].map("{:.2f}%".format)
gender_df

                       Total Percent
Male                     652  83.59%
Female                   113  14.49%
Other / Non-Disclosed     15   1.92%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [22]:
avg_price_group = purchase_data.groupby(["Gender"], as_index=False) ["Price"].mean()
avg_price=avg_price_group.rename(columns={"Price": "Average Price"})
avg_price

                  Gender  Average Price
0                 Female       3.203009
1                   Male       3.017853
2  Other / Non-Disclosed       3.346000

In [60]:
#fix
purchases_sum = purchase_data.groupby(["Gender"], as_index=False) ["Price"].sum()
purchases_sum_new = purchases_sum.rename(columns={"Price": "Purchases (Sum)"})
purchases_sum_new

                  Gender  Purchases (Sum)
0                 Female           361.94
1                   Male          1967.64
2  Other / Non-Disclosed            50.19

In [61]:
total_purchases_sum = purchases_sum_new["Purchases (Sum)"].sum(axis=0)
total_purchases

780

In [35]:
purchase_count = purchase_data.groupby(["Gender"], as_index=False) ["Purchase ID"].count()
purchase_count_new = purchase_count.rename(columns={"Purchase ID": "Purchases (Count)"})
purchase_count_new

                  Gender  Purchases (Count)
0                 Female                113
1                   Male                652
2  Other / Non-Disclosed                 15

In [63]:
#Ask about average purchase total per person
merged_df= pd.merge(purchase_count_new, avg_price, how="left")
merged_df1 = pd.merge(merged_df, purchases_sum_new)
merged_df1
merged_df1 ["Average Purchase %"] = (merged_df1["Purchases (Sum)"]/len(purchase_data))
merged_df1 ["Average Price"] = merged_df1["Average Price"].map("${:.2f}".format)
merged_df1["Average Purchase %"]=merged_df1["Average Purchase %"].map("{:.2f}%".format)
#.style.format('${0:,.2f}'))
merged_df1.drop(columns=["Purchases (Sum)"])

                  Gender  Purchases (Count) Average Price Average Purchase %
0                 Female                113         $3.20              0.46%
1                   Male                652         $3.02              2.52%
2  Other / Non-Disclosed                 15         $3.35              0.06%

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [99]:
purchase_data["Age"].min()
purchase_data["Age"].max()
bins=[0, 12, 19, 29, 39, 49, 100]
group_names=["Child (0-12)", "Teen (13-19)", "Twenty (20-29)", "Thirty(30-39)", "Forty(40-49)", "Fifty+"]

In [100]:
purchase_data["Age Summary"] = pd.cut(purchase_data["Age"], bins, labels=group_names, include_lowest=True)

In [101]:
ageGroups_df = purchase_data.groupby("Age Summary")
ageGroups_df
purchases_count_Age = purchase_data.groupby(["Age Summary"], as_index=False) ["Purchase ID"].count()
purchases_count_Age

      Age Summary  Purchase ID
0    Child (0-12)           45
1    Teen (13-19)          142
2  Twenty (20-29)          466
3   Thirty(30-39)          114
4    Forty(40-49)           13
5          Fifty+            0

In [109]:
ageGroups_df = purchase_data.groupby("Age Summary")
purchasesRevenue_Age = purchase_data.groupby(["Age Summary"], as_index=False) ["Price"].sum()
purchasesRevenue_Age

      Age Summary    Price
0    Child (0-12)   143.55
1    Teen (13-19)   429.25
2  Twenty (20-29)  1407.06
3   Thirty(30-39)   361.67
4    Forty(40-49)    38.24
5          Fifty+     0.00

In [113]:
ageGroups_df = purchase_data.groupby("Age Summary")
purchasePercent_Age = purchase_data.groupby(["Age Summary"], as_index=False) ["Price"].mean()
purchasePercent_Age

      Age Summary     Price
0    Child (0-12)  3.190000
1    Teen (13-19)  3.022887
2  Twenty (20-29)  3.019442
3   Thirty(30-39)  3.172544
4    Forty(40-49)  2.941538
5          Fifty+       NaN

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame